/** ID,下一独白ID,独白 */
/** 第一位章节ID,第二位独白ID,其余为独白段ID */

let soliloquyObj = {
    11001: { nxId: 11002, type: 1, sound: "yiku1", txt: "过节回家守则第一条：\n如果你还是单身\n回家后一定要低调\n不要引起亲戚们的注意" },
    11002: { nxId: 11003, type: 1, sound: "yiku2", txt: "过节回家守则第二条：\n如果你妈妈给你安排相亲\n不要和她顶嘴" },
    11003: { nxId: 0, type: 1, sound: "yiku3", txt: "过节回家守则第三条：\n如果前面两条你都没有遵守\n那么你可以学我\n买一张第二天的机票\n逃得远远的" },

    //顾线大圆满 
    11621: { nxId: 0, type: 2, sound: "", txt: "夏日的晚风\n总是在最没有防备时迎面而来\n就像一段不期而至的爱情\n让你长发飘飘\n心中痒痒\n你这可爱的小狼狗\n就是这段旅途中\n那阵惬意的凉风吧" },
    //顾线意难平
    11626: { nxId: 11627, type: 2, sound: "", txt: "顾廷巍：\n我很喜欢你\n真的很喜欢你\n如果现在我更年轻一点\n我一定会和你在一起\n但现在\n我们处在一个不同的生命阶段里\n你现在要去追求的目的地\n不是我停靠的终点" },
    11627: { nxId: 11628, type: 2, sound: "", txt: "你有着自由的灵魂\n你适合的是一场更纯粹的恋爱\n我们只是一小段人生旅途中的同路客\n而我注定要在这一站下车\n但是我会珍惜我们度过的\n这短暂而美好的时光\n就当这是一场美好的梦吧" },
    11628: { nxId: 0, type: 2, sound: "", txt: "愿你红尘做伴\n永不孤单" },

    //博线大圆满
    11631: { nxId: 0, type: 2, sound: "", txt: "爱情是一只不羁的鸟儿\n任谁都无法驯服\n你想捉住它\n它就抖抖翅膀飞去\n你生气想要离开它\n它却又转身安慰你\n真是个甜蜜而又恼人的东西呢" },
    //博线意难平
    11636: { nxId: 11637, type: 2, sound: "", txt: "疲劳是旅行的一部分\n有时候遗憾也是旅行的一部分\n人生总有诸多遗憾\n不是只要喜欢就能完美结局" },
    11637: { nxId: 11638, type: 2, sound: "", txt: "或许正是这些遗憾\n让我们变得更加坚强\n更懂得珍惜现在\n而那些遗憾\n也成为记忆中无法抹去的一部分\n缺憾却也曾经美好" },
    11638: { nxId: 0, type: 2, sound: "", txt: "巴塞罗那\n再见" },

    //程线大圆满
    11611: { nxId: 0, type: 2, sound: "", txt: "缘分这个事情还真的是妙不可言\n当我转了一圈\n竟然站回了原点\n这感觉还真是奇怪\n不过\n要是没有这场任性的逃跑\n大概人生也不会这么有趣吧" },
    //程线意难平
    11616: { nxId: 11617, type: 2, sound: "", txt: "很多年后\n或许我会想起今天的不告而别\n那时\n程昱川的面容都会觉得模糊" },
    11617: { nxId: 11618, type: 2, sound: "", txt: "来巴塞之前\n我没想过我会遇到这样的一个人\n我不知道以后的我会不会难过\n但情绪终究会被时光磨平\n最后只会记得" },
    11618: { nxId: 11619, type: 2, sound: "", txt: "年轻的时候\n在异国他乡\n曾经有一个人拉着我的手\n走遍了这个城市的大街小巷\n能够保留下一份被时光封存的回忆\n已然足够" },
    11619: { nxId: 0, type: 2, sound: "", txt: "巴塞罗那\n再见" },
    
}

export class CfgSoliloquy {
    public soliloquy: any = soliloquyObj;
}